#pragma once

#include <cstdio>
#include <vector>

class avi final {
private:
    // The files are comprised of a collection of chunks.
    struct chunk_type {
        // Four letter character code identifying the chunk type.
        unsigned int identifier;
        // Length of the chunk's data.
        unsigned int length;
    };
    static_assert(sizeof(chunk_type) == 8);

public:
    // The main avi header.
    struct avih_type final {
        // Contains the duration of one video frame in microseconds.
        unsigned int microseconds_per_frame;
        // Highest occuring data rate within the file.
        unsigned int max_bytes_per_seccond;
        // Pad to multiples of this size;
        unsigned int padding_granularity;
        // Flags:
        // 0x00000010 - The file has an index.
        // 0x00000020 - The order in which the video and audio chunks must be replayed is determined by the index and may differ from the order in which those chunks occur in the file.
        // 0x00000100 - The streams are properly interleaved into each other.
        // 0x00000800 - This flag indicates that the keyframe flags in the index are reliable.
        // 0x00010000 - The file was captured.
        // 0x00020000 - Is the content copyrighted.
        unsigned int flags;
        // Number of frames.
        unsigned int total_frames;
        // Number of frames audio data is skewed ahead of the video frames in interleaved files.
        unsigned int initial_frames;
        // Number of streams in the file.
        unsigned int stream_count;
        // Suggested buffer size for reading the file.
        unsigned int suggested_buffer_size;
        // Width of the video.
        unsigned int width;
        // Height of the video.
        unsigned int height;
        // Reserved.
        unsigned int reserved[4];
    };
    static_assert(sizeof(avih_type) == 56);

    // A stream header.
    struct strh_type {
        // Four letter character code identifying the stream type, can be 'vids', 'auds', 'mids' or 'txts' for video, audio and subtitles.
        unsigned int type;
        // Four letter character code identifying the codec to be used for this stream.
        unsigned int handler;
        // Flags:
        // 0x00000001 - Stream should not be activated by default.
        // 0x00010000 - Stream is a video stream using palettes where the palette is changing during playback.
        unsigned int flags;
        // Specifies priority of a stream. In a file with multiple streams of the same type, the highest priority might be the default.
        unsigned short priority;
        // Language of the stream.
        unsigned short language;
        // Number of the first block of the stream that is present in the file.
        unsigned int initial_frames;
        // rate / scale == samples / second
        unsigned int scale;
        // rate / scale == samples / second
        unsigned int rate;
        // Start time of stream.
        unsigned int start;
        // Size of stream in units as defined in rate and scale
        unsigned int length;
        // Size of buffer necessary to store blocks of that stream.
        unsigned int suggested_buffer_size;
        // Stream quality.
        unsigned int quality;
        // The number of bytes of the smallest part of a stream that should not be split any further.
        unsigned int sample_size;
        // The destination rectangle for a text or video stream within the width and height members of the main header.
        struct rect_type {
            short int left;
            short int top;
            short int right;
            short int bottom;
        } destination;
    };
    static_assert(sizeof(strh_type) == 56);

    // Stream formats are different for each stream type:
    // - BITMAPINFOHEADER for video streams.
    // - WAVEFORMATEX or PCMWAVEFORMAT for audio streams.
    // - Nothing for text streams.
    // - Nothing for midi streams.
    struct strf_vids_type {
        // Size of this BITMAPINFOHEADER and any additional data following it in bytes.
        unsigned int header_size;
        // Width of image in pixels.
        int width;
        // Height of image in pixels, for uncompressed images positive values mean bottom up and negative top down.
        int height;
        // The number of planes for the target device, should be 1.
        unsigned short planes;
        // Number of bits per pixel.
        unsigned short bit_count;
        // Flag or Four letter character code identifying the compression used.
        // 0x00000000 - Uncompressed RGB
        // 0x00000003 - Uncompressed RGB with color masks.
        // 0xXXXXXXXX - Four letter character code for compressed images.
        unsigned int compression_identifier;
        // Size of the image in bytes.
        unsigned int image_size;
        // Horizontal resolution in pixels per meter.
        int horizontal_pixels_per_meter;
        // Vertical resolution in pixels per meter.
        int vertical_pixels_per_meter;
        // The number of colour indices in the colour table that are actually used in the image.
        unsigned int colours_used;
        // The number of colour indices in the colour table that are important for displaying the image.
        unsigned int colours_important;
    };
    static_assert(sizeof(strf_vids_type) == 40);

    struct strf_auds_type {
        // TODO: Currently ignoring audio chunks.
    };
    static_assert(sizeof(strf_auds_type) == 1);

private:
    struct index_type {
        unsigned int chunk_id;
        // Flags:
        // 0x00000001 - The data of the chunk in the movi chunk is a rec list.
        // 0x00000010 - Frame is a keyframe.
        // 0x00000100 - The chunk does not affect the timing of the stream.
        unsigned int flags;
        unsigned int offset;
        unsigned int size;
    };
    static_assert(sizeof(index_type) == 16);

public:
    struct frame_type {
        const unsigned char* data;
        unsigned long long int length;
    };

private:
    struct chunk_node_type {
        const chunk_type* chunk;
        unsigned int form;
        std::vector<chunk_node_type> children;
    };

public:
    struct stream_type {
        const strh_type* strh;
        const strf_vids_type* strf_vids;
        const strf_auds_type* strf_auds;
        std::vector<frame_type> frames;
    };

private:
    chunk_node_type root_chunk_node;
    const avih_type* avih;
    std::vector<stream_type> streams;

public:
    bool parse(const unsigned char* data, unsigned long long int length) {
        this->streams.clear();

        if (!parse_chunks(&data[0], length, this->root_chunk_node)) {
            std::fprintf(stderr, "Error: Failed to parse root chunk.\n");
            return false;
        }

        if (this->root_chunk_node.chunk->identifier != fourcc("RIFF")) {
